{
  "status_effects": {
    "glossary": [
      {
        "name": "Blinded",
        "description": "A blinded creature can't see and automatically fails any ability check that requires sight. Attack rolls against the creature have advantage, and the creature's attack rolls have a -4 penalty."
      },
      {
        "name": "Burning",
        "description": "A burning creature takes 1d6 fire damage at the start of each of its turns."
      },
      {
        "name": "Frightened",
        "description": "A frightened creature has a -2 penalty on ability checks and attack rolls while the source of its fear is within line of sight. The creature can't willingly move closer to the source of its fear."
      },
      {
        "name": "Poisoned",
        "description": "A poisoned creature has a -2 penalty on all attack rolls and ability checks. Some potent poisons may also deal damage over time."
      },
      {
        "name": "Restrained",
        "description": "A restrained creature's speed becomes 0. Attack rolls against the creature have advantage."
      },
      {
        "name": "Stunned",
        "description": "A stunned creature is incapacitated, can't move, and automatically fails Might and Agility checks. Attack rolls against the creature have advantage."
      },
      {
        "name": "Ablaze",
        "description": "The target is engulfed in fire. Takes 1d8 fire damage at the start of each of its turns. This damage persists until the fire is put out by a specific action or ability."
      },
      {
        "name": "Bleeding",
        "description": "The target is suffering from a deep wound. Takes 1d6 physical damage at the start of its turn. This effect can be ended by a successful Mind (Survival) check (DC 10) or by a healing ability."
      },
      {
        "name": "Slowed",
        "description": "The target's movement speed is halved, and they have a -1 penalty to all Agility checks and Agility-based attack rolls."
      },
      {
        "name": "Deafened",
        "description": "A deafened creature can't hear and automatically fails any ability check that requires hearing."
      },
      {
        "name": "Confused",
        "description": "A confused creature cannot take reactions and must roll a d10 at the start of its turn. On a 1-5, it attacks a random creature (friend or foe) within range. On a 6-10, it takes a random major action (e.g., move, use an item, do nothing)."
      },
      {
        "name": "Diseased",
        "description": "A creature afflicted with a disease takes a -2 penalty to its Vitality and Resolve maximums. This effect persists until the disease is cured by a specific ability or item."
      },
      {
        "name": "Paralyzed",
        "description": "A paralyzed creature is incapacitated and cannot move or speak. Attack rolls against the creature have advantage."
      }
    ]
  }
}
