{
  "name": "Eldra",
  "char_id": "MISTWRAITH_ELDRA",
  "type": "Spectral humanoid",
  "role": "Oracle/Controller",
  "background": "The ghostly remnant of an ancient oracle from the Mistwood Vale, a tribe that lived near the Sunken City of Astora. Bound by a powerful ritual, she joins the hero to uncover the true history of the Shattering.",
  "narrative_hook": "Her spectral presence attracts other spirits who are drawn to her power, some seeking aid, others seeking to consume her. Her ancient knowledge can guide the party to forgotten ruins and artifacts.",
  "weapon_proficiency": {
    "favored_types": [
      "Ring"
    ],
    "bonus_effect": "+1 to Attack Rolls with favored weapon types.",
    "penalty_effect": "-2 to Attack Rolls with non-favored weapon types."
  },
  "progression_path": {
    "attribute_priority": [
      "Mind",
      "Spirit",
      "Agility",
      "Might"
    ],
    "skill_priority": [
      "Arcana",
      "Lore",
      "Diplomacy"
    ],
    "chosen_playstyle": "Path of the Oracle"
  },
  "progression_type": "Static",
  "playstyles": [
    {
      "path_name": "Path of the Oracle",
      "description": "This path focuses on Eldra's connection to the spirits of the past, allowing her to act as a battlefield clairvoyant. She manipulates fate, reveals enemy weaknesses, and cripples foes with debilitating curses and prophecies of ruin.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Whispers of the Fallen",
              "effect": "Eldra channels the voices of the dead, forcing a target to make a Spirit DC 13 check or become 'Frightened' for 1 round."
            },
            {
              "name": "Fateful Glimpse",
              "effect": "As a bonus action, grant one ally Advantage or one enemy Disadvantage on their very next d10 roll."
            }
          ]
        },
        {
          "tier": "Adept (Level 5+)",
          "talents": [
            {
              "name": "Commune with Spirits",
              "effect": "As a major action, you can make a Mind (Lore) DC 14 check against a single enemy. On a success, you learn one of their resistances or vulnerabilities, which is then revealed to the party. This costs 5 Resolve."
            },
            {
              "name": "Weight of Ages",
              "effect": "As a major action, you curse a target with a vision of their own demise. They must make a Spirit DC 13 check or have their movement speed halved and deal 2 less damage on all attacks for 3 rounds. This costs 5 Resolve."
            }
          ]
        },
        {
          "tier": "Expert (Level 10+)",
          "talents": [
            {
              "name": "Echoes of the Shattering",
              "effect": "As a major action, you unleash a psychic echo of the world-breaking cataclysm in a 15-foot radius. Enemies in the area must make a Spirit DC 14 check or suffer a -2 penalty on all of their rolls for 1 round. This costs 10 Resolve."
            },
            {
              "name": "Spirit Ward",
              "effect": "You create a 15-foot radius circle of shimmering energy for 3 rounds. Allies inside are immune to the 'Frightened' condition, and any Undead creature that enters the area takes 2d8 light damage. This costs 10 Resolve."
            }
          ]
        },
        {
          "tier": "Master (Level 15+)",
          "talents": [
            {
              "name": "Binding Oath",
              "effect": "You place a powerful curse on a single enemy for 3 rounds. If that enemy attacks any creature other than you, they immediately take 3d10 psychic damage. This costs 15 Resolve."
            },
            {
              "name": "Visions of Ruin (Modifies Fateful Glimpse)",
              "effect": "When you successfully use Fateful Glimpse to give an enemy Disadvantage, they also become Vulnerable to the next source of damage they take."
            }
          ]
        },
        {
          "tier": "Archon (Level 20)",
          "talents": [
            {
              "name": "Oracle's Decree (Ultimate)",
              "effect": "For 3 rounds, you can see moments into the future. At the start of each of your turns, you can grant all allies a choice: their next attack roll is automatically a success, OR the next attack roll against them is automatically a failure. This can only be used once per day and costs 20 Resolve."
            }
          ]
        }
      ]
    },
    {
      "path_name": "Path of the Mistwraith",
      "description": "This path focuses on Eldra's ghostly form and her control over the ethereal mists. She becomes a master of battlefield repositioning and control, phasing through attacks, creating disorienting fog, and ensnaring foes with spectral energy.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Incorporeal Phase (Reaction)",
              "effect": "When hit by a physical attack, you can use your reaction to briefly become ethereal, halving the damage taken."
            },
            {
              "name": "Misty Step",
              "effect": "As a bonus action, you can teleport up to 30 feet to an unoccupied space you can see."
            }
          ]
        },
        {
          "tier": "Adept (Level 5+)",
          "talents": [
            {
              "name": "Disorienting Fog",
              "effect": "As a major action, you create a 20-foot radius sphere of dense fog that is heavily obscured. Enemies inside the fog cannot take Reactions. This lasts for 3 rounds and costs 5 Resolve."
            },
            {
              "name": "Phase Strike",
              "effect": "As a major action, you make a melee attack dealing 2d8 cold damage. Whether you hit or miss, you can immediately teleport to an empty space on the opposite side of the target. This costs 5 Resolve."
            }
          ]
        },
        {
          "tier": "Expert (Level 10+)",
          "talents": [
            {
              "name": "Grasp of the Grave",
              "effect": "As a major action, ethereal hands erupt from the ground in a 15-foot radius. Enemies in the area must make an Agility DC 14 check or become 'Restrained' for 1 round. This costs 10 Resolve."
            },
            {
              "name": "Ethereal Form",
              "effect": "As a major action, you become fully incorporeal for 1 round. You are immune to physical damage, can move through creatures and objects as if they were difficult terrain, but you cannot attack or use an ability. This costs 10 Resolve."
            }
          ]
        },
        {
          "tier": "Master (Level 15+)",
          "talents": [
            {
              "name": "Possession",
              "effect": "As a major action, you attempt to possess a single humanoid target. The target must make a Spirit DC 16 check. On a failure, you control their next turn completely. This can only be attempted once per creature per combat. This costs 15 Resolve."
            },
            {
              "name": "Suffocating Mist (Modifies Disorienting Fog)",
              "effect": "Enemies that end their turn inside your Disorienting Fog now also take 2d6 cold damage."
            }
          ]
        },
        {
          "tier": "Archon (Level 20)",
          "talents": [
            {
              "name": "Spirit Tornado (Ultimate)",
              "effect": "You dissolve into a swirling vortex of mist and screaming spirits in a 30-foot radius for 3 rounds. The area is heavily obscured. Enemies who start their turn inside the vortex take 4d10 cold damage and have their movement speed reduced to 0 for that turn. As a bonus action, you can teleport to any unoccupied space within the vortex. This can only be used once per day and costs 20 Resolve."
            }
          ]
        }
      ]
    }
  ]
}
