{
  "name": "Sprout",
  "char_id": "SEEDLING_SPROUT",
  "type": "Verdant Seedling",
  "role": "Tank/Healer",
  "background": "A newly awakened forest guardian from the now-corrupted Whispering Woods. It communicates through simple gestures and empathic feelings. It has imprinted on Rya, sensing a primal connection to her draconic power.",
  "narrative_hook": "Sprout is a key to understanding the deep corruption spreading through the land. Its growth and evolution are directly tied to the party's efforts to heal the world, and it may be able to purify corrupted locations.",
  "weapon_proficiency": {
    "favored_types": [
      "Gauntlets",
      "Unarmed"
    ],
    "bonus_effect": "+1 to Attack Rolls with favored weapon types.",
    "penalty_effect": "-2 to Attack Rolls with non-favored weapon types."
  },
  "progression_path": {
    "attribute_priority": [
      "Might",
      "Spirit",
      "Mind",
      "Agility"
    ],
    "skill_priority": [
      "Survival",
      "Combat",
      "Athletics"
    ],
    "chosen_playstyle": "Path of the Grove"
  },
  "playstyles": [
    {
      "path_name": "Path of the Earthshaker",
      "description": "This path is inspired by Peco's incredible physical might and ability to shake the ground. It focuses on raw physical power, battlefield control, and unparalleled durability.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Slam",
              "effect": "As a major action, Sprout slams its body into a single target. It deals 1d10 physical damage and has a chance to knock the target prone on a failed Might DC 12 check."
            },
            {
              "name": "Photosynthesis (Passive)",
              "effect": "At the start of Sprout's turn, if it is in an area with at least dim light (sunlight or equivalent), it passively regenerates 2 points of Vitality."
            }
          ]
        },
        {
          "tier": "Adept (Level 5+)",
          "talents": [
            {
              "name": "Crushing Vines",
              "effect": "As a major action, Sprout commands a tangle of vines to attack an enemy within 30 feet, dealing 2d8 physical damage. On a successful hit, the target's movement speed is halved for 1 round. This costs 5 Resolve."
            },
            {
              "name": "Iron Bark",
              "effect": "As a bonus action, Sprout hardens its bark, gaining a +2 bonus to its damage reduction for 3 rounds. This costs 5 Resolve."
            }
          ]
        },
        {
          "tier": "Expert (Level 10+)",
          "talents": [
            {
              "name": "Overgrowth",
              "effect": "As a major action, Sprout causes a 20-foot radius area to become overgrown with thorny vines. The area is considered difficult terrain, and any enemy that moves through it takes 1d6 physical damage. This lasts for 3 rounds and costs 10 Resolve."
            },
            {
              "name": "Seismic Roar (Modifies Slam)",
              "effect": "When you use Slam, all enemies in a 10-foot radius around the target must make an Agility DC 14 check or be knocked prone."
            }
          ]
        },
        {
          "tier": "Master (Level 15+)",
          "talents": [
            {
              "name": "Gaea's Embrace",
              "effect": "As a major action, Sprout causes the ground beneath a single target to become a sinkhole. The target must make a Might DC 16 check or be restrained and take 2d10 bludgeoning damage at the start of each of their turns. This lasts for 3 rounds and costs 15 Resolve."
            },
            {
              "name": "Roots of the Mountain (Passive)",
              "effect": "While planted on the ground, Sprout is immune to all effects that would move or knock it prone."
            }
          ]
        },
        {
          "tier": "Archon (Level 20)",
          "talents": [
            {
              "name": "Worldshaker (Ultimate)",
              "effect": "As a major action, Sprout channels its full power into the ground, causing a massive earthquake in a 60-foot radius. All enemies in the area take 6d12 physical damage and are knocked prone. This can only be used once per day and costs 20 Resolve."
            }
          ]
        }
      ]
    },
    {
      "path_name": "Path of the Grove",
      "description": "This path is inspired by Spar's connection to nature and support magic. It focuses on healing, restorative abilities, and powerful utility through the manipulation of plant life.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Healing Spores",
              "effect": "As a major action, Sprout releases a cloud of restorative spores in a 10-foot radius. All allies within the area (including Sprout) are healed for 1d8 Vitality."
            },
            {
              "name": "Thorn Whip",
              "effect": "As a major action, Sprout can extend a thorny vine up to 30 feet to grapple an enemy, dealing 1d6 piercing damage."
            }
          ]
        },
        {
          "tier": "Adept (Level 5+)",
          "talents": [
            {
              "name": "Cleansing Bloom",
              "effect": "As a major action, Sprout purifies the air around an ally, removing one negative status effect. This costs 5 Resolve."
            },
            {
              "name": "Sunbeam",
              "effect": "As a bonus action, Sprout can summon a ray of sunlight on a single ally, restoring 2d8 Vitality. This costs 5 Resolve."
            }
          ]
        },
        {
          "tier": "Expert (Level 10+)",
          "talents": [
            {
              "name": "Forest's Embrace",
              "effect": "As a major action, Sprout can entangle an enemy within 30 feet with thick vines, forcing a Might DC 14 check. On a failure, the enemy is Restrained and cannot take reactions for 3 rounds. This costs 10 Resolve."
            },
            {
              "name": "Healing Bloom (Modifies Healing Spores)",
              "effect": "When you use Healing Spores, the healing is increased to 2d8 Vitality, and it also removes the Poisoned status effect from all affected allies."
            }
          ]
        },
        {
          "tier": "Master (Level 15+)",
          "talents": [
            {
              "name": "Verdant Rebirth",
              "effect": "Once per day, as a major action, Sprout can plant a seed on an ally who is reduced to 0 Vitality. The seed immediately brings the ally back to life with 1 Vitality and a Stable status. This costs 15 Resolve."
            },
            {
              "name": "Font of Life (Passive)",
              "effect": "Sprout's Photosynthesis ability now affects all allies within 10 feet of it."
            }
          ]
        },
        {
          "tier": "Archon (Level 20)",
          "talents": [
            {
              "name": "Genesis Bloom (Ultimate)",
              "effect": "As a major action, Sprout channels the very essence of life into the battlefield. For 3 rounds, at the start of each of your turns, all allies in a 60-foot radius are healed for 4d10 Vitality. Additionally, any ally who would be reduced to 0 Vitality is instead reduced to 1 Vitality. This can only be used once per day and costs 20 Resolve."
            }
          ]
        }
      ]
    }
  ]
}
