{
  "name": "Talia",
  "char_id": "SKYVEIL_TALIA",
  "type": "Skyveil (Falcon-like humanoid)",
  "role": "Scout/Archer",
  "background": "A young, hot-headed scout from the Sky-Reach Aerie. She left her isolationist home seeking adventure and to prove her worth. She is fiercely independent but loyal to those who earn her respect.",
  "narrative_hook": "Talia is on a personal quest to track down a notorious Arcane Dominion captain who shot her down and left her for dead. This captain is a recurring antagonist who holds a valuable relic the party needs.",
  "weapon_proficiency": {
    "favored_types": [
      "Longbow",
      "Shortbow",
      "Dagger"
    ],
    "bonus_effect": "+1 to Attack Rolls with favored weapon types.",
    "penalty_effect": "-2 to Attack Rolls with non-favored weapon types."
  },
  "progression_path": {
    "attribute_priority": [
      "Agility",
      "Mind",
      "Might",
      "Spirit"
    ],
    "skill_priority": [
      "Survival",
      "Athletics",
      "Stealth"
    ],
    "chosen_playstyle": "Path of the Sharpshooter"
  },
  "playstyles": [
    {
      "path_name": "Path of the Sharpshooter",
      "description": "This path focuses on Talia's peerless skill with the bow, turning her into a deadly marksman who can eliminate targets from extreme distances and exploit enemy weaknesses with pinpoint accuracy.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Called Shot",
              "effect": "As a bonus action, you can take a -2 penalty to your next ranged attack roll. If the attack hits, you deal an additional 1d8 damage."
            },
            {
              "name": "Eagle Eye (Passive)",
              "effect": "You do not suffer disadvantage on ranged attack rolls due to long range."
            }
          ]
        },
        {
          "tier": "Adept (Level 5+)",
          "talents": [
            {
              "name": "Pinning Shot",
              "effect": "As a major action, you fire a special arrow at a target. The attack deals normal damage, and the target must make a Might DC 13 check or have their movement speed reduced to 0 for 1 round. This costs 5 Resolve."
            },
            {
              "name": "Find the Mark (Modifies Called Shot)",
              "effect": "The bonus damage from your Called Shot ability increases from 1d8 to 1d10."
            }
          ]
        },
        {
          "tier": "Expert (Level 10+)",
          "talents": [
            {
              "name": "Arcing Shot",
              "effect": "You can make ranged attacks against targets that are behind half or three-quarters cover by arcing your shot over the obstacle."
            },
            {
              "name": "Rapid Fire",
              "effect": "As a major action, you can make two ranged attacks instead of one, but both are made with a -2 penalty. This costs 10 Resolve."
            }
          ]
        },
        {
          "tier": "Master (Level 15+)",
          "talents": [
            {
              "name": "Deadeye (Passive)",
              "effect": "Your ranged attacks now score a critical hit on a roll of 9 or 10."
            },
            {
              "name": "Ricochet Shot",
              "effect": "You can use your Reaction to redirect a missed ranged attack to a new target within 15 feet of the original. Make a new attack roll with a -2 penalty against the new target."
            }
          ]
        },
        {
          "tier": "Archon (Level 20)",
          "talents": [
            {
              "name": "True Shot (Ultimate)",
              "effect": "As a major action, you can make a single, perfect shot. This attack automatically hits, is a guaranteed critical hit, and deals maximum possible damage. This can only be used once per day and costs 20 Resolve."
            }
          ]
        }
      ]
    }
  ]
}
