{
  "name": "Zael",
  "char_id": "VOID_ZAEL",
  "type": "Human (Void-touched)",
  "role": "Mystic/Illusionist",
  "background": "A mysterious foundling raised alongside Rya in Windmark Village, his true origins are tied to the Void Chasm. He is a source of wisdom with no memory of his past, but his powers risk a slow corruption from Elysia's whispers, amplified by the nearby Elysian Grand Cathedral.",
  "narrative_hook": "His presence attracts attention from the Champions of Order. Elysia's whispers constantly echo in his mind, a tempting voice promising him the strength to protect his friends if only he would submit to her perfect, unchaotic order.",
  "weapon_proficiency": {
    "favored_types": [
      "Dagger",
      "Sword"
    ],
    "bonus_effect": "+1 to Attack Rolls with favored weapon types.",
    "penalty_effect": "-2 to Attack Rolls with non-favored weapon types."
  },
  "progression_path": {
    "attribute_priority": [
      "Mind",
      "Spirit",
      "Agility",
      "Might"
    ],
    "skill_priority": [
      "Arcana",
      "Stealth",
      "Lore"
    ],
    "chosen_playstyle": "Path of the Void-Touched (Pre-Awakening)"
  },
  "playstyles": [
    {
      "path_name": "Path of the Void-Touched (Pre-Awakening)",
      "description": "This talent tree reflects Zael's abilities as they are now: the subtle tricks and illusions of a mystic whose powers are a result of his lineage but are not yet consciously controlled.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Shadow Veil",
              "effect": "As a major action, you grant Advantage on a Stealth check to one ally within 30 feet."
            },
            {
              "name": "Chilling Whisper",
              "effect": "A whispered word that forces a single target to make a Spirit DC 12 check or have a -2 penalty on their next roll."
            },
            {
              "name": "Wraith's Insight",
              "effect": "As a major action, you reveal hidden truths or illusions in a 30-foot radius."
            }
          ]
        },
        {
          "tier": "Adept (Level 5+)",
          "talents": [
            {
              "name": "Void Step",
              "effect": "As a bonus action, you can teleport up to 15 feet to a shadowed or unlit area. This movement does not provoke an Attack of Opportunity. This costs 5 Resolve."
            },
            {
              "name": "Ethereal Tether",
              "effect": "As a major action, you can connect an enemy within 30 feet to a lingering void field. The enemy's movement speed is halved for 3 rounds. This costs 5 Resolve."
            }
          ]
        },
        {
          "tier": "Expert (Level 10+)",
          "talents": [
            {
              "name": "Mental Echo",
              "effect": "As a major action, you can touch a creature and make a Mind DC 15 check against them. On a success, you can read their surface thoughts or a single important memory. This can be used once per day and costs 10 Resolve."
            },
            {
              "name": "Flickering Image (Modifies Shadow Veil)",
              "effect": "When you use Shadow Veil on an ally, their image becomes blurred, and they gain a +2 bonus to their defense rolls for 1 round."
            }
          ]
        },
        {
          "tier": "Master (Level 15+)",
          "talents": [
            {
              "name": "Shadow Bind (Modifies Void Step)",
              "effect": "When you use Void Step, you can choose to leave a lingering void field behind. Any enemy that moves into the space you just left has their movement speed halved for 1 round. This costs 15 Resolve."
            },
            {
              "name": "Phantom Strike",
              "effect": "As a major action, you can create a shadowy duplicate of yourself that strikes a target within 30 feet, dealing 2d10 necrotic damage. This costs 15 Resolve."
            }
          ]
        },
        {
          "tier": "Archon (Level 20)",
          "talents": [
            {
              "name": "Perfected Illusion (Ultimate)",
              "effect": "As a major action, you can create a perfect, solid illusion of yourself with half your current Vitality that lasts for 1 minute. It can take any action you could take, using your stats. This can only be used once per day and costs 20 Resolve."
            }
          ]
        }
      ]
    },
    {
      "path_name": "Path of the Dragon (Post-Awakening)",
      "description": "Once Zael's draconic heritage is fully awakened, this tree would replace his Void-Touched tree. He will gain access to a full, two-path lineage tree for the Void affinity.",
      "abilities": [
        {
          "tier": "Novice (Level 1+)",
          "talents": [
            {
              "name": "Minor Drain",
              "effect": "As a major action, you touch a creature, dealing 1d6 necrotic damage and regaining Vitality equal to half the damage dealt."
            },
            {
              "name": "Entropy Bolt",
              "effect": "A basic, single-target damage and debuff ability."
            }
          ]
        }
      ]
    }
  ]
}
